# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

In [3]:
url="https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv"

### Step 3. Assign it to a variable called baby_names.

In [4]:
baby_names=pd.read_csv(url)

baby_names.to_csv('US_Baby_Names_right.csv',index=False)

### Step 4. See the first 10 entries

In [5]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [20]:
baby_names.drop(['Unnamed: 0','Id'],axis=1,inplace=True) #axis=1 for columns and axis=0 for rows

KeyError: "['Unnamed: 0', 'Id'] not found in axis"

### Step 6. Is there more male or female names in the dataset?

In [21]:
baby_names.groupby('Gender').count()

          Name    Year   State   Count
Gender
F       558846  558846  558846  558846
M       457549  457549  457549  457549

### Step 7. Group the dataset by name and assign to names

In [26]:
Names=baby_names.groupby('Name')
Names.head()

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1004923  Gryffin  2014      M    WI      5
1004950     Kroy  2014      M    WI      5
1004973     Owyn  2014      M    WI      5
1005707   Haylea  2005      F    WV      5
1012216  Coalton  2012      M    WV      7

[65502 rows x 5 columns]

### Step 8. How many different names exist in the dataset?

In [25]:
baby_names.Name.nunique()

17632

### Step 9. What is the name with most occurrences?

In [28]:
baby_names.groupby('Name').count().sort_values('Count',ascending=False)

         Year  Gender  State  Count
Name
Riley    1112    1112   1112   1112
Avery    1080    1080   1080   1080
Jordan   1073    1073   1073   1073
Peyton   1064    1064   1064   1064
Hayden   1049    1049   1049   1049
...       ...     ...    ...    ...
Ethon       1       1      1      1
Malajah     1       1      1      1
Euan        1       1      1      1
Azyria      1       1      1      1
Nissen      1       1      1      1

[17632 rows x 4 columns]

### Step 10. How many different names have the least occurrences?

In [30]:

baby_names.groupby('Name').count().sort_values('Count',ascending=True)

           Year  Gender  State  Count
Name
Katherina     1       1      1      1
Breyona       1       1      1      1
Greidy        1       1      1      1
Shriyan       1       1      1      1
Briah         1       1      1      1
...         ...     ...    ...    ...
Hayden     1049    1049   1049   1049
Peyton     1064    1064   1064   1064
Jordan     1073    1073   1073   1073
Avery      1080    1080   1080   1080
Riley      1112    1112   1112   1112

[17632 rows x 4 columns]

### Step 11. What is the median name occurrence?

In [35]:
baby_names.groupby('Name').count().median()

Year      8.0
Gender    8.0
State     8.0
Count     8.0
dtype: float64

### Step 12. What is the standard deviation of names?

In [37]:
baby_names.groupby('Name').count().std()

Year      122.029964
Gender    122.029964
State     122.029964
Count     122.029964
dtype: float64

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [40]:
baby_names.describe()

               Year         Count
count  1.016395e+06  1.016395e+06
mean   2.009053e+03  3.485012e+01
std    3.138293e+00  9.739735e+01
min    2.004000e+03  5.000000e+00
25%    2.006000e+03  7.000000e+00
50%    2.009000e+03  1.100000e+01
75%    2.012000e+03  2.600000e+01
max    2.014000e+03  4.167000e+03